huangcaihui/6190_MCU/G13R7F0C907_FSL_EXAMPLE20180416/G13R7F0C907_FSL_EXAMPLE20180416/r01an0718_praxis01/FSLT01_V220_R5F100xE_REN110/lib/fsl.h
/*==============================================================================================*/
/* Project      = Flash self-programming library, MF3 single voltage flash                      */
/* Module       = fsl.h                                                                         */
/* Device:      = RL78                                                                          */
/* Version      = V2.20                                                                         */
/*==============================================================================================*/
/*                                  COPYRIGHT                                                   */
/*==============================================================================================*/
/* Copyright(c) 2010,2011,2012 Renesas Electronics Corporation                                  */
/*==============================================================================================*/
/* Purpose:                                                                                     */
/*              constant and function prototype definitions used by the FSL                     */
/*                                                                                              */
/*==============================================================================================*/
/*                                                                                              */
/* RENESAS ELECTRONICS CONFIDENTIAL AND PROPRIETARY.                                            */
/* This program must be used solely for the purpose for which it was furnished                  */
/* by Renesas Electronics Corporation. No part of this program may be reproduced or             */
/* disclosed to others, in any form, without the prior written permission of                    */
/* Renesas Electronics Corporation.                                                             */
/*                                                                                              */
/*==============================================================================================*/

#ifndef __FSL_H_INCLUDED
#define __FSL_H_INCLUDED


/*==============================================================================================*/
/* include files list                                                                           */
/*==============================================================================================*/
#include "fsl_types.h"


/*==============================================================================================*/
/* constant definitions                                                                         */
/*==============================================================================================*/

/*status code definitions returned by the FSL functions                                         */
#define   FSL_OK                    0x00      /* no problems                                    */
#define   FSL_ERR_PARAMETER         0x05      /* parameter error                                */
#define   FSL_ERR_PROTECTION        0x10      /* protection error (access right conflict)       */
#define   FSL_ERR_ERASE             0x1A      /* erase error                                    */
#define   FSL_ERR_BLANKCHECK        0x1B      /* blankcheck error (MRG11)                       */
#define   FSL_ERR_IVERIFY           0x1B      /* internal verify error (MRG11)                  */
#define   FSL_ERR_WRITE             0x1C      /* write error                                    */
#define   FSL_ERR_FLOW              0x1F      /* flow error (wrong timing calling)              */
#define   FSL_IDLE                  0x30      /* idle state (any action is not running)         */
#define   FSL_SUSPEND               0x43      /* previous flash action is suspended             */
#define   FSL_BUSY                  0xFF      /* command is being processed                     */


/*==============================================================================================*/
/* global function prototypes                                                                   */
/*==============================================================================================*/


/*----------------------------------------------------------------------------------------------*/
/* Block type:   FSL command function                                                           */
/*----------------------------------------------------------------------------------------------*/
/* Purpose:      initialization of flash environment                                            */
/*                                                                                              */
/* Input:        *descriptor_pstr - FSL descriptor                                              */
/* Output:       -                                                                              */
/* Returned:     fsl_u08, status_code                                                           */
/*                   = 0x00(FSL_OK), normal and means initialization OK                         */
/*                   = 0x05(FSL_ERR_PARAMETER), parameter error or HOCO isn't started           */
/*----------------------------------------------------------------------------------------------*/
extern fsl_u08  FSL_Init(__far fsl_descriptor_t* descriptor_pstr);


/*----------------------------------------------------------------------------------------------*/
/* Block type:   FSL command function                                                           */
/*----------------------------------------------------------------------------------------------*/
/* Purpose:      opens flash environment                                                        */
/* Input:        -                                                                              */
/* Output:       -                                                                              */
/* Returned:     -                                                                              */
/*----------------------------------------------------------------------------------------------*/
extern void  FSL_Open(void);


/*----------------------------------------------------------------------------------------------*/
/* Block type:   FSL command function                                                           */
/*----------------------------------------------------------------------------------------------*/
/* Purpose:      closes flash environment                                                       */
/* Input:        -                                                                              */
/* Output:       -                                                                              */
/* Returned:     -                                                                              */
/*----------------------------------------------------------------------------------------------*/
extern void  FSL_Close(void);


/*----------------------------------------------------------------------------------------------*/
/* Block type:   FSL command function                                                           */
/*----------------------------------------------------------------------------------------------*/
/* Purpose:      prepares following functions to be called                                      */
/*               FSL_BlankCheck, FSL_Erase, FSL_Write, FSL_IVerify, FSL_StatusCheck             */
/* Input:        -                                                                              */
/* Output:       -                                                                              */
/* Returned:     -                                                                              */
/*----------------------------------------------------------------------------------------------*/
extern void  FSL_PrepareFunctions(void);


/*----------------------------------------------------------------------------------------------*/
/* Block type:   FSL command function                                                           */
/*----------------------------------------------------------------------------------------------*/
/* Purpose:      prepares following functions to be called                                      */
/*               FSL_Set*ProtectFlag, FSL_InvertBootFlag, FSL_SetFlashShieldWindow,             */
/*               FSL_SwapBootCluster, FSL_SwapActiveBootCluster                                 */
/* Input:        -                                                                              */
/* Output:       -                                                                              */
/* Returned:     -                                                                              */
/*----------------------------------------------------------------------------------------------*/
extern void  FSL_PrepareExtFunctions(void);


/*----------------------------------------------------------------------------------------------*/
/* Block type:   FSL command function                                                           */
/*----------------------------------------------------------------------------------------------*/
/* Purpose:      changes all vector addresses to specified address in RAM                       */
/* Input:        fsl_interrupt_destination_u16 - vector address in RAM (Lower 16 bits address)  */
/* Output:       -                                                                              */
/* Returned:     -                                                                              */
/*----------------------------------------------------------------------------------------------*/
extern void  FSL_ChangeInterruptTable(fsl_u16 fsl_interrupt_destination_u16);


/*----------------------------------------------------------------------------------------------*/
/* Block type:   FSL command function                                                           */
/*----------------------------------------------------------------------------------------------*/
/* Purpose:      restores all vector addresses to initial vector addresses                      */
/* Input:        -                                                                              */
/* Output:       -                                                                              */
/* Returned:     -                                                                              */
/*----------------------------------------------------------------------------------------------*/
extern void  FSL_RestoreInterruptTable(void);


/*----------------------------------------------------------------------------------------------*/
/* Block type:   FSL command function                                                           */
/*----------------------------------------------------------------------------------------------*/
/* Purpose:      checks if specified block is blank                                             */
/* Input:        block_u16 - block number has to be checked                                     */
/* Output:       -                                                                              */
/* Returned:     fsl_u08, status_code                                                           */
/*                   = 0x00(FSL_OK), normal and means "block is blank"                          */
/*                   = 0x05(FSL_ERR_PARAMETER), parameter error                                 */
/*                   = 0x1B(FSL_ERR_BLANKCHECK), blank-check error, means "block is not blank"  */
/*                   = 0x1F(FSL_ERR_FLOW), last operation has not finished, yet.                */
/*                                      or violates the precondition.                           */
/*                                      or FSL is suspending.                                   */
/*                   = 0xFF(FSL_BUSY), normal and means "process was started"                   */
/*----------------------------------------------------------------------------------------------*/
extern fsl_u08  FSL_BlankCheck(fsl_u16 block_u16);


/*----------------------------------------------------------------------------------------------*/
/*  Block type:  FSL command function                                                           */
/*----------------------------------------------------------------------------------------------*/
/*  Purpose:     erase specified block                                                          */
/*  Input:       block_u16 - block number has to be erase                                       */
/*  Output:      -                                                                              */
/*  Returned:    fsl_u08, status_code                                                           */
/*                   = 0x00(FSL_OK), normal and means "block erased successfully"               */
/*                   = 0x05(FSL_ERR_PARAMETER), parameter error                                 */
/*                   = 0x10(FSL_ERR_PROTECTION), protection error                               */
/*                   = 0x1A(FSL_ERR_ERASE), erase error                                         */
/*                   = 0x1F(FSL_ERR_FLOW), last operation has not finished, yet.                */
/*                                      or violates the precondition.                           */
/*                                      or FSL is suspending.                                   */
/*                   = 0xFF(FSL_BUSY), normal and means "process was started"                   */
/*----------------------------------------------------------------------------------------------*/
extern fsl_u08  FSL_Erase(fsl_u16 block_u16);


/*----------------------------------------------------------------------------------------------*/
/* Block type:   FSL command function                                                           */
/*----------------------------------------------------------------------------------------------*/
/* Purpose:      performs internal verify on specified block                                    */
/* Input:        block_u16 - block number has to be verified                                    */
/* Output:       -                                                                              */
/* Returned:     fsl_u08, status_code                                                           */
/*                   = 0x00(FSL_OK), normal and means "block is verified"                       */
/*                   = 0x05(FSL_ERR_PARAMETER), parameter error                                 */
/*                   = 0x1B(FSL_ERR_IVERIFY), internal verify error                             */
/*                   = 0x1F(FSL_ERR_FLOW), last operation has not finished, yet.                */
/*                                      or violates the precondition.                           */
/*                                      or FSL is suspending.                                   */
/*                   = 0xFF(FSL_BUSY), normal and means "process was started"                   */
/*----------------------------------------------------------------------------------------------*/
extern fsl_u08  FSL_IVerify(fsl_u16 block_u16);


/*----------------------------------------------------------------------------------------------*/
/* Block type:   FSL command function                                                           */
/*----------------------------------------------------------------------------------------------*/
/* Purpose:      writes N words from the data buffer into flash                                 */
/* Input:        *write_pstr - struct fsl_write_t to write                                      */
/* Output:       -                                                                              */
/* Condition:    1) (&fsl_destination_address MOD 4 == 0)                                       */
/*               2) most significant byte (MSB) of fsl_destination_address_u32 has to be 0x00   */
/*                  Means: 0x00abcdef 24 bit flash address allowed                              */
/*               3) (0 < fsl_word_count_u08 <= 64)                                              */
/*               4) (fsl_word_count_u08 <= sizeof(data buffer))                                 */
/*                  NOT CHECKED BY FSL                                                          */
/* Returned:     fsl_u08, status code                                                           */
/*                   = 0x00(FSL_OK), normal                                                     */
/*                   = 0x05(FSL_ERR_PARAMETER), parameter error                                 */
/*                   = 0x10(FSL_ERR_PROTECTION), protection error                               */
/*                   = 0x1C(FSL_ERR_WRITE), write error                                         */
/*                   = 0x1F(FSL_ERR_FLOW), last operation has not finished, yet.                */
/*                                      or violates the precondition.                           */
/*                                      or FSL is suspending.                                   */
/*                   = 0xFF(FSL_BUSY), normal and means "process was started"                   */
/*----------------------------------------------------------------------------------------------*/
extern fsl_u08  FSL_Write(__near fsl_write_t* write_pstr);


/*----------------------------------------------------------------------------------------------*/
/* Block type:   FSL command function                                                           */
/*----------------------------------------------------------------------------------------------*/
/* Purpose:      controls the flash action start/continue/check for the last called function    */
/* Input:        -                                                                              */
/* Output:       -                                                                              */
/* Returned:     fsl_u08, status code                                                           */
/*                   = 0x00(FSL_OK), normal                                                     */
/*                   = 0x1A(FSL_ERR_ERASE), erase error                                         */
/*                   = 0x1B(FSL_ERR_BLANKCHECK), blank-check error, means "block not blank"     */
/*                   = 0x1B(FSL_ERR_IVERIFY), internal verify error                             */
/*                   = 0x1C(FSL_ERR_WRITE), write error                                         */
/*                   = 0x1F(FSL_ERR_FLOW), violates the precondition.                           */
/*                                      or FSL is suspending.                                   */
/*                   = 0x30(FSL_IDLE), any action is not running                                */
/*                   = 0xFF(FSL_BUSY), normal and means "process was not finished"              */
/*----------------------------------------------------------------------------------------------*/
extern fsl_u08  FSL_StatusCheck(void);


/*----------------------------------------------------------------------------------------------*/
/* Block type:   FSL command function                                                           */
/*----------------------------------------------------------------------------------------------*/
/* Purpose:      suspends the flash action                                                      */
/* Input:        -                                                                              */
/* Output:       -                                                                              */
/* Returned:     fsl_u08, status code                                                           */
/*                   = 0x00(FSL_OK), previous flash action is OK.                               */
/*                                   And the state is suspended.                                */
/*                   = 0x1A(FSL_ERR_ERASE), previous flash action is Erase error.               */
/*                                   And the state is suspended.                                */
/*                   = 0x1B(FSL_ERR_BLANKCHECK), previous flash action is Blank error.          */
/*                                   And the state is suspended.                                */
/*                   = 0x1B(FSL_ERR_IVERIFY), previous flash action is IVerify error.           */
/*                                   And the state is suspended.                                */
/*                   = 0x1C(FSL_ERR_WRITE), previous flash action is Write error.               */
/*                                   And the state is suspended.                                */
/*                   = 0x1F(FSL_ERR_FLOW), violates the precondition.                           */
/*                                      or has been already suspending.                         */
/*                   = 0x30(FSL_IDLE), any action are not running.                              */
/*                                   And the state is suspended.                                */
/*                   = 0x43(FSL_SUSPEND), OK, previous flash action is suspended.               */
/*----------------------------------------------------------------------------------------------*/
extern fsl_u08  FSL_StandBy(void);


/*----------------------------------------------------------------------------------------------*/
/* Block type:   FSL command function                                                           */
/*----------------------------------------------------------------------------------------------*/
/* Purpose:      resumes the flash action                                                       */
/* Input:        -                                                                              */
/* Output:       -                                                                              */
/* Returned:     fsl_u08, status code                                                           */
/*                   = 0x00(FSL_OK), resumed flash action is OK.                                */
/*                                   And the state is resumed from the suspended state.         */
/*                   = 0x1A(FSL_ERR_ERASE), resumed flash action is Erase error.                */
/*                                   And the state is resumed from the suspended state.         */
/*                   = 0x1F(FSL_ERR_FLOW), violates the precondition.                           */
/*                                      or FSL is not suspending.                               */
/*                   = 0xFF(FSL_BUSY), resumed flash action is BUSY.                            */
/*                                   And the state is resumed from the suspended state.         */
/*----------------------------------------------------------------------------------------------*/
extern fsl_u08  FSL_WakeUp(void);


