huangcaihui/6190_MCU/G13R7F0C907_FSL_EXAMPLE20180416/G13R7F0C907_FSL_EXAMPLE20180416/r01an0718_praxis01/FSLT01_V220_R5F100xE_REN110/lib/fsl.h
/*----------------------------------------------------------------------------------------------*/
/* Block type:   FSL command function                                                           */
/*----------------------------------------------------------------------------------------------*/
/* Purpose:      puts the security information into the destination variable                    */
/* Input:        *data_destination_pu08 - destination variable of the security info             */
/*               The format of the security info is: "unsigned char"                            */
/*                                                                                              */
/*               Format of the security info:                                                   */
/*               bit_1 = 0 -> boot-area re-programming disabled, otherwise enabled              */
/*               bit_2 = 0 -> block erase command disabled, otherwise enabled                   */
/*               bit_4 = 0 -> write command disabled, otherwise enabled                         */
/*               other bits = 1                                                                 */
/* Output:       data_destination_pu08 - security info                                          */
/* Returned:     fsl_u08, status code                                                           */
/*                   = 0x00(FSL_OK), normal                                                     */
/*                   = 0x1F(FSL_ERR_FLOW), last operation has not finished, yet.                */
/*                                      or violates the precondition.                           */
/*                                      or FSL is suspending.                                   */
/*----------------------------------------------------------------------------------------------*/
extern fsl_u08  FSL_GetSecurityFlags(fsl_u08 __near *data_destination_pu08);


/*----------------------------------------------------------------------------------------------*/
/* Block type:   FSL command function                                                           */
/*----------------------------------------------------------------------------------------------*/
/* Purpose:      puts the boot flag into the destination variable                               */
/* Input:        *data_destination_pu08 - destination variable of the boot flag                 */
/*               The format of the boot flag info is: "unsigned char"                           */
/*               The value of the boot info is 0x00 for cluster 0 and 0x01 for cluster 1.       */
/* Output:       data_destination_pu08 - the boot flag info                                     */
/* Returned:     fsl_u08, status code                                                           */
/*                   = 0x00(FSL_OK), normal                                                     */
/*                   = 0x1F(FSL_ERR_FLOW), last operation has not finished, yet.                */
/*                                      or violates the precondition.                           */
/*                                      or FSL is suspending.                                   */
/*----------------------------------------------------------------------------------------------*/
extern fsl_u08  FSL_GetBootFlag(fsl_u08 __near *data_destination_pu08);


/*----------------------------------------------------------------------------------------------*/
/* Block type:   FSL command function                                                           */
/*----------------------------------------------------------------------------------------------*/
/* Purpose:      puts the state of swap boot clusters into the destination variable             */
/* Input:        *data_destination_pu08 - destination variable of the state of boot info        */
/*               The format of the state of boot info is: "unsigned char"                       */
/*               The value of the state of boot info is 0x00 for cluster 0                      */
/*               and 0x01 for cluster 1.                                                        */
/* Output:       data_destination_pu08 - the state of boot info                                 */
/* Returned:     fsl_u08, status code                                                           */
/*                   = 0x00(FSL_OK), normal                                                     */
/*                   = 0x1F(FSL_ERR_FLOW), last operation has not finished, yet.                */
/*                                      or violates the precondition.                           */
/*                                      or FSL is suspending.                                   */
/*----------------------------------------------------------------------------------------------*/
extern fsl_u08  FSL_GetSwapState(fsl_u08 __near *data_destination_pu08);


/*----------------------------------------------------------------------------------------------*/
/* Block type:   FSL command function                                                           */
/*----------------------------------------------------------------------------------------------*/
/* Purpose:     puts the last address of the specified block into fsl_destination_address_u32   */
/* Input:       *getblockendaddr_pstr - struct fsl_getblockendaddr_t to get the last address    */
/* Output:      fsl_destination_address_u32 - the last address                                  */
/* Returned:    fsl_u08, status code                                                            */
/*                   = 0x00(FSL_OK), normal                                                     */
/*                   = 0x05(FSL_ERR_PARAMETER), parameter error                                 */
/*                   = 0x1F(FSL_ERR_FLOW), last operation has not finished, yet.                */
/*                                      or violates the precondition.                           */
/*                                      or FSL is suspending.                                   */
/*----------------------------------------------------------------------------------------------*/
extern fsl_u08  FSL_GetBlockEndAddr(__near fsl_getblockendaddr_t* getblockendaddr_pstr);


/*----------------------------------------------------------------------------------------------*/
/* Block type:   FSL command function                                                           */
/*----------------------------------------------------------------------------------------------*/
/* Purpose:      puts the information about the protected flash area into fsl_*_block_u16       */
/* Input:        *getfsw_pstr - struct fsl_fsw_t to get FSW                                     */
/* Output:       fsl_start_block_u16 - the start block of FSW                                   */
/*               fsl_end_block_u16 - the end block of FSW                                       */
/* Returned:     fsl_u08, status code                                                           */
/*                   = 0x00(FSL_OK), normal                                                     */
/*                   = 0x1F(FSL_ERR_FLOW), last operation has not finished, yet.                */
/*                                      or violates the precondition.                           */
/*                                      or FSL is suspending.                                   */
/*----------------------------------------------------------------------------------------------*/
extern fsl_u08  FSL_GetFlashShieldWindow(__near fsl_fsw_t* getfsw_pstr);


/*----------------------------------------------------------------------------------------------*/
/* Block type:   FSL command function                                                           */
/*----------------------------------------------------------------------------------------------*/
/* Purpose:      sets specified security flag by dedicated command-function.                    */
/*                                                                                              */
/*               There are following security levels:                                           */
/*               a) block-erase protection                                                      */
/*               b) write protection                                                            */
/*               c) boot-cluster protection                                                     */
/*                                                                                              */
/*               CAUTION:                                                                       */
/*               Each security flag can be written by the application only once                 */
/*                                                                                              */
/* Input:        -                                                                              */
/* Output:       -                                                                              */
/* Returned:     fsl_u08, status code                                                           */
/*                   = 0x00(FSL_OK), normal                                                     */
/*                   = 0x1A(FSL_ERR_ERASE), erase error                                         */
/*                   = 0x1B(FSL_ERR_IVERIFY), internal verify error                             */
/*                   = 0x1C(FSL_ERR_WRITE), write error                                         */
/*                   = 0x1F(FSL_ERR_FLOW), last operation has not finished, yet.                */
/*                                      or violates the precondition.                           */
/*                                      or FSL is suspending.                                   */
/*                   = 0xFF(FSL_BUSY), normal and means "process was started"                   */
/*----------------------------------------------------------------------------------------------*/
extern fsl_u08  FSL_SetBlockEraseProtectFlag(void);
extern fsl_u08  FSL_SetWriteProtectFlag(void);
extern fsl_u08  FSL_SetBootClusterProtectFlag(void);


/*----------------------------------------------------------------------------------------------*/
/* Block type:   FSL command function                                                           */
/*----------------------------------------------------------------------------------------------*/
/* Purpose:      inverts the boot flag.                                                         */
/*                                                                                              */
/*               CAUTION:                                                                       */
/*               After reset, the boot clusters will be switched regarding this boot flag       */
/* Input:        -                                                                              */
/* Output:       -                                                                              */
/* Returned:     fsl_u08, status code                                                           */
/*                   = 0x00(FSL_OK), normal                                                     */
/*                   = 0x10(FSL_ERR_PROTECTION), protection error                               */
/*                   = 0x1A(FSL_ERR_ERASE), erase error                                         */
/*                   = 0x1B(FSL_ERR_IVERIFY), internal verify error                             */
/*                   = 0x1C(FSL_ERR_WRITE), write error                                         */
/*                   = 0x1F(FSL_ERR_FLOW), last operation has not finished, yet.                */
/*                                      or violates the precondition.                           */
/*                                      or FSL is suspending.                                   */
/*                   = 0xFF(FSL_BUSY), normal and means "process was started"                   */
/*----------------------------------------------------------------------------------------------*/
extern fsl_u08  FSL_InvertBootFlag(void);


/*----------------------------------------------------------------------------------------------*/
/* Block type:   FSL command function                                                           */
/*----------------------------------------------------------------------------------------------*/
/* Purpose:      defines a new Flash Shield Window inside the flash memory                      */
/* Input:        *setfsw_pstr - struct fsl_fsw_t to set FSW                                     */
/* Output:       -                                                                              */
/* Returned:     fsl_u08, status code                                                           */
/*                   = 0x00(FSL_OK), normal                                                     */
/*                   = 0x05(FSL_ERR_PARAMETER), parameter error                                 */
/*                   = 0x10(FSL_ERR_PROTECTION), protection error                               */
/*                   = 0x1A(FSL_ERR_ERASE), erase error                                         */
/*                   = 0x1B(FSL_ERR_IVERIFY), internal verify error                             */
/*                   = 0x1C(FSL_ERR_WRITE), write error                                         */
/*                   = 0x1F(FSL_ERR_FLOW), last operation has not finished, yet.                */
/*                                      or violates the precondition.                           */
/*                                      or FSL is suspending.                                   */
/*                   = 0xFF(FSL_BUSY), normal and means "process was started"                   */
/*----------------------------------------------------------------------------------------------*/
extern fsl_u08  FSL_SetFlashShieldWindow(__near fsl_fsw_t* setfsw_pstr);


/*----------------------------------------------------------------------------------------------*/
/* Block type:   FSL command function                                                           */
/*----------------------------------------------------------------------------------------------*/
/* Purpose:      swaps boot cluster 0 and boot cluster 1 physically without setting             */
/*               the boot flag. After swap the library jumps to the address of the              */
/*               reset vector.                                                                  */
/*                                                                                              */
/*               CAUTION:                                                                       */
/*               After reset, the boot cluster will be switched regarding the boot flag         */
/* Input:        -                                                                              */
/* Output:       -                                                                              */
/* Returned:     fsl_u08, status code                                                           */
/*                   = 0x10(FSL_ERR_PROTECTION), protection error                               */
/*                   = 0x1F(FSL_ERR_FLOW), last operation has not finished, yet.                */
/*                                      or violates the precondition.                           */
/*                                      or FSL is suspending.                                   */
/*----------------------------------------------------------------------------------------------*/
extern fsl_u08  FSL_SwapBootCluster(void);


/*----------------------------------------------------------------------------------------------*/
/* Block type:   FSL command function                                                           */
/*----------------------------------------------------------------------------------------------*/
/* Purpose:      inverts the boot flag and swaps boot cluster 0 and boot cluster 1 physically   */
/*                                                                                              */
/*               CAUTION:                                                                       */
/*               After reset, the boot clusters will be switched regarding this boot flag       */
/* Input:        -                                                                              */
/* Output:       -                                                                              */
/* Returned:     fsl_u08, status code                                                           */
/*                   = 0x00(FSL_OK), normal                                                     */
/*                   = 0x10(FSL_ERR_PROTECTION), protection error                               */
/*                   = 0x1A(FSL_ERR_ERASE), erase error                                         */
/*                   = 0x1B(FSL_ERR_IVERIFY), internal verify error                             */
/*                   = 0x1C(FSL_ERR_WRITE), write error                                         */
/*                   = 0x1F(FSL_ERR_FLOW), last operation has not finished, yet.                */
/*                                      or violates the precondition.                           */
/*                                      or FSL is suspending.                                   */
/*                   = 0xFF(FSL_BUSY), normal and means "process was started"                   */
/*----------------------------------------------------------------------------------------------*/
extern fsl_u08  FSL_SwapActiveBootCluster(void);


/*----------------------------------------------------------------------------------------------*/
/* Block type:   FSL command function                                                           */
/*----------------------------------------------------------------------------------------------*/
/* Purpose:      forces a hardware reset via illegal instruction                                */
/* Input:        -                                                                              */
/* Output:       -                                                                              */
/* Returned:     -                                                                              */
/*----------------------------------------------------------------------------------------------*/
extern void  FSL_ForceReset(void);


/*----------------------------------------------------------------------------------------------*/
/* Block type:   FSL command function                                                           */
/*----------------------------------------------------------------------------------------------*/
/* Purpose:      gets the internal version information of the used FSL                          */
/* Input:        -                                                                              */
/* Output:       -                                                                              */
/* Returned:     pointer to version string                                                      */
/*----------------------------------------------------------------------------------------------*/
extern __far fsl_u08* FSL_GetVersionString(void);


#endif
